$unitsHashtable = @{
    "Командування повітряних сил" = @("Командування","Штаб","1 управління","2 управління","3 управління","4 управління","5 управління")
    "10 полк стратегічної авіації" = @("Штаб","1 ескадрилья","2 ескадрилья","3 ескадрилья","Ремонтна група","Група матеріального забезпечення")
    "14 полк стратегічної авіації" = @("Штаб","1 ескадрилья","2 ескадрилья","3 ескадрилья","Ремонтна група","Група матеріального забезпечення")
    "7 ескадрилья винищувальної авіації" = @("Штаб","1 ескадрилья","2 ескадрилья","3 ескадрилья","Ремонтна група","Група матеріального забезпечення")
    "23 полк дальньої авіації" = @("Штаб","1 ескадрилья","2 ескадрилья","3 ескадрилья","Ремонтна група","Група матеріального забезпечення")
    "12 база забезпечення" = @("Група ремонту винищувальної авіації","Група ремонту бомбардувальників","Група ремонту гвинтокрилів","Відділення планування")
};