$unitsHashtable = @{
    "Командування військ звʼязку та кібербезпеки" = @("Командування","Штаб","1 управління","2 управління","3 управління","4 управління","5 управління");
    "Військовий інститут телекомунікацій та інформатизації" = @("Командування","Управління","1 факультет","2 факультет","3 факультет");
    "ВЧ0351" = @("1 батальйон звʼязку","2 батальйон звʼязку","Рота тропосферного звʼязку","Лінійна рота");
    "ВЧ0215" = @("1 батальйон звʼязку","2 батальйон звʼязку","Рота тропосферного звʼязку","Лінійна рота");
    "ВЧ4721" = @("1 батальйон звʼязку","2 батальйон звʼязку","Рота тропосферного звʼязку","Лінійна рота");
    "ВЧ0683" = @("1 батальйон звʼязку","2 батальйон звʼязку","Рота тропосферного звʼязку","Лінійна рота");
    "10 полк забезпечення звʼяку ГШ ЗСУ" = @("1 батальйон звʼязку","2 батальйон звʼязку","3 батальйон звʼязку","Рота тропосферного звʼязку","Лінійна рота");
};