$unitsHashtable = @{
    "Управління фінансового забезпечення" = @("Управління","Секретаріат","1 відділ","2 відділ","3 відділ")
    "Управління правового забезпечення" = @("Управління","Секретаріат","1 відділ","2 відділ","3 відділ")
    "Управління тилового забезпечення" = @("Управління","Секретаріат","1 відділ","2 відділ","3 відділ")
    "Управління міжнародного співробітництва" = @("Управління","Секретаріат","1 відділ","2 відділ","3 відділ")
    "Управління стратегічного планування" = @("Управління","Секретаріат","1 відділ","2 відділ","3 відділ")
};