$unitsHashtable = @{
    "Командування сухопутних військ" = @("Командування","Штаб","1 управління","2 управління","3 управління","4 управління","5 управління")
    "ОК Захід" = @{
        "Командування ОК Захід" = @("Командування","Штаб","1 управління","2 управління","3 управління")
        "ВЧ4531" = @("Штаб","1 батальйон","2 батальйон","3 батальйон","Танковий батальйон","Артилерійський дивізіон")
        "ВЧ2122" = @("Штаб","1 батальйон","2 батальйон","3 батальйон","Танковий батальйон","Артилерійський дивізіон")
        "ВЧ0998" = @("Штаб","1 батальйон","2 батальйон","3 батальйон","Танковий батальйон","Артилерійський дивізіон")
        "ВЧ3123" = @("Штаб","1 батальйон","2 батальйон","3 батальйон","Танковий батальйон","Артилерійський дивізіон")
        "ВЧ1232" = @("Штаб","1 батальйон","2 батальйон","3 батальйон","Танковий батальйон","Артилерійський дивізіон")
    }
    "ОК Схід" = @{
        "Командування ОК Схід" = @("Командування","Штаб","1 управління","2 управління","3 управління")
            "ВЧ9832" = @("Штаб","1 батальйон","2 батальйон","3 батальйон","Танковий батальйон","Артилерійський дивізіон")
            "ВЧ9831" = @("Штаб","1 батальйон","2 батальйон","3 батальйон","Танковий батальйон","Артилерійський дивізіон")
            "ВЧ6452" = @("Штаб","1 батальйон","2 батальйон","3 батальйон","Танковий батальйон","Артилерійський дивізіон")
            "ВЧ3128" = @("Штаб","1 батальйон","2 батальйон","3 батальйон","Танковий батальйон","Артилерійський дивізіон")
            "ВЧ0645" = @("Штаб","1 батальйон","2 батальйон","3 батальйон","Танковий батальйон","Артилерійський дивізіон")
    }
    "ОК Північ" = @{
        "Командування ОК Північ" = @("Командування","Штаб","1 управління","2 управління","3 управління")
        "ВЧ4363" = @("Штаб","1 батальйон","2 батальйон","3 батальйон","Танковий батальйон","Артилерійський дивізіон")
        "ВЧ7846" = @("Штаб","1 батальйон","2 батальйон","3 батальйон","Танковий батальйон","Артилерійський дивізіон")
        "ВЧ0746" = @("Штаб","1 батальйон","2 батальйон","3 батальйон","Танковий батальйон","Артилерійський дивізіон")
        "ВЧ1286" = @("Штаб","1 батальйон","2 батальйон","3 батальйон","Танковий батальйон","Артилерійський дивізіон")
        "ВЧ0715" = @("Штаб","1 батальйон","2 батальйон","3 батальйон","Танковий батальйон","Артилерійський дивізіон")
    }
    "ОК Південь" = @{
        "Командування ОК Південь" = @("Командування", "Штаб", "1 управління", "2 управління", "3 управління")
        "ВЧ5935" = @("Штаб", "1 батальйон", "2 батальйон", "3 батальйон", "Танковий батальйон", "Артилерійський дивізіон")
        "ВЧ0754" = @("Штаб", "1 батальйон", "2 батальйон", "3 батальйон", "Танковий батальйон", "Артилерійський дивізіон")
        "ВЧ0903" = @("Штаб", "1 батальйон", "2 батальйон", "3 батальйон", "Танковий батальйон", "Артилерійський дивізіон")
        "ВЧ3234" = @("Штаб", "1 батальйон", "2 батальйон", "3 батальйон", "Танковий батальйон", "Артилерійський дивізіон")
        "ВЧ6745" = @("Штаб", "1 батальйон", "2 батальйон", "3 батальйон", "Танковий батальйон", "Артилерійський дивізіон")
    }
};