$unitsHashtable = @{
    "Департамент фінансового забезпечення" = @("Управління департаменту","Секретаріат","1 відділ","2 відділ","3 відділ")
    "Департамент правового забезпечення" = @("Управління департаменту","Секретаріат","1 відділ","2 відділ","3 відділ")
    "Департамент тилового забезпечення" = @("Управління департаменту","Секретаріат","1 відділ","2 відділ","3 відділ")
    "Департамент міжнародного співробітництва" = @("Управління департаменту","Секретаріат","1 відділ","2 відділ","3 відділ")
    "Департамент стратегічного планування" = @("Управління департаменту","Секретаріат","1 відділ","2 відділ","3 відділ")
};

foreach ($key in $unitsHashtable.Keys) {
    Write-Host "$($key): $($unitsHashtable[$key])";
}