$unitsHashtable = @{
    "Командування ракетних військ та артилерії" = @("Командування","Штаб","1 управління","2 управління","3 управління","4 управління","5 управління")
    "7 бригада реактивної артилерії" = @("Штаб","1 дивізіон","2 дивізіон","3 дивізіон")
    "25 бригада реактивної артилерії" = @("Штаб","1 дивізіон","2 дивізіон","3 дивізіон")
    "45 артилерійська бригада" = @("Штаб","1 дивізіон","2 дивізіон","3 дивізіон")
    "28 артилерійська бригада" = @("Штаб","1 дивізіон","2 дивізіон","3 дивізіон")
}; 