$unitsHashtable = @{
    "Командування сил спеціальних операцій" = @("Командування","Штаб","1 управління","2 управління","3 управління","4 управління","5 управління")
    "3 полк ССО" = @("Штаб","1 батальйон","2 батальйон","Розвідувальна рота","Польовий вузол звʼязку","Група БПЛА")
    "5 полк ССО" = @("Штаб","1 батальйон","2 батальйон","Розвідувальна рота","Польовий вузол звʼязку")
    "11 полк ССО" = @("Штаб","1 батальйон","2 батальйон","Розвідувальна рота","Польовий вузол звʼязку")
    "12 полк ІПСО" = @("Штаб","1 батальйон","2 батальйон","Розвідувальна рота","Польовий вузол звʼязку")
};